app/Models/TransactionModel.php

    public function getAllBlocks(): array
    {
        $db = \Config\Database::connect();
        return $db->table('blocks')
                  ->orderBy('block_index', 'ASC')
                  ->get()
                  ->getResultArray();
---
SELECT *
FROM `blocks`
ORDER BY `block_index` ASC

    public function getTotalValue(): float
{
    $db  = \Config\Database::connect();
    $row = $db->table('transactions')
              ->selectSum('price', 'total')
              ->where('status', 'confirmed')
              ->get()
              ->getRowArray();
---
SELECT SUM(`price`) AS `total`
FROM `transactions`
WHERE `status` = 'confirmed'

public function getRecentTransactions(int $limit = 10): array
{
    $db = \Config\Database::connect();
    return $db->table('transactions')
              ->orderBy('created_at', 'DESC')
              ->limit($limit)
              ->get()
              ->getResultArray();
---
SELECT *
FROM `transactions`
ORDER BY `created_at` DESC
 LIMIT 8

public function getCategoryDistribution(): array
{
    $db = \Config\Database::connect();
    return $db->table('transactions')
              ->select('category, COUNT(*) as total, SUM(price) as revenue')
              ->groupBy('category')
              ->orderBy('total', 'DESC')
              ->get()
              ->getResultArray();
---
SELECT `category`, COUNT(*) as total, SUM(price) as revenue
FROM `transactions`
GROUP BY `category`
ORDER BY `total` DESC

public function countBlocks(): int
{
    $db = \Config\Database::connect();
    return (int) $db->table('blocks')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `blocks`

public function countByStatus(): array
{
    $db     = \Config\Database::connect();
    $result = ['pending' => 0, 'confirmed' => 0, 'rejected' => 0];
    $rows   = $db->table('transactions')
                 ->select('status, COUNT(*) as total')
                 ->groupBy('status')
                 ->get()
                 ->getResultArray();
---
SELECT `status`, COUNT(*) as total
FROM `transactions`
GROUP BY `status`